import { ScrollView, StyleSheet, View } from "react-native";
import React, { memo } from "react";
import { Colors } from "../../constants/Colors";
import { Mon400, Mon700 } from "../../components/StyledText";

const SecretPrivacyScreen = memo(() => {
  return (
    <ScrollView showsVerticalScrollIndicator={false} style={styles.container}>
      <Mon700 style={styles.title}>“Эмуна” Нууцлалын бодлого</Mon700>
      <Mon700 style={styles.title}>Нэг Ерөнхий нөхцөл</Mon700>
      <View style={styles.listContainer}>
        <Mon400>1.1</Mon400>
        <Mon400 style={styles.listText}>
          Бид Эмуна aппликейшн (“Эмуна”)-д бүртгэлтэй Хэрэглэгчийн хувийн мэдээллийн халдашгүй байдлыг хамгаалах зарчмыг баримталж, Танаас цахимаар
          олгосон зөвшөөрлийн үндсэн дээр хувийн мэдээллийг цуглуулж, боловсруулж, ашиглана.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>1.2</Mon400>
        <Mon400 style={styles.listText}>
          Нууцлалын бодлогоор Хэрэглэгчийн хувийн мэдээллийг цуглуулах, боловсруулах, ашиглахтай холбоотой харилцааг зохицуулна. Тус бодлого нь Монгол
          Улсын Хүний хувийн мэдээлэл хамгаалах тухай хуульд нийцсэн бөгөөд тусгайлан зохицуулсан харилцаанд тус хуулийг дагаж мөрдөнө.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>1.3</Mon400>
        <Mon400 style={styles.listText}>Нууцлалын бодлогод дурдсан дараах нэр томъёог дор дурдсан утгаар ойлгож, хэрэглэнэ. Үүнд:</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.3.1</Mon400>
        <Mon400 style={styles.listText}>
          “Хүний хувийн мэдээлэл” гэж Хэрэглэгчийн зөвшөөрлөөр Бидний цуглуулж, боловсруулж, ашиглаж буй хүний эмзэг мэдээлэл болон хүний нэр, төрсөн
          он, сар, өдөр, төрсөн газар, оршин суугаа газрын хаяг, байршил, иргэний бүртгэлийн дугаар, хөрөнгө, боловсрол, гишүүнчлэл, цахим
          тодорхойлогч, хүнийг шууд болон шууд бусаар тодорхойлох боломжтой бусад мэдээллийг;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.3.2</Mon400>
        <Mon400 style={styles.listText}>
          “Эрүүл мэндийн мэдээлэл” гэж хүний бие махбод, сэтгэцийн эрүүл мэнд болон эрүүл мэндийн тусламж, үйлчилгээ авсан тухай мэдээллийг;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.3.3</Mon400>
        <Mon400 style={styles.listText}>
          “Хэрэглэгч” эсхүл “Та” гэж Эмуна-д нэвтэрч, өөрийн бүртгэлийг үүсгэн, Бидний үйлчилгээг авах гэж буй 18 (арван найм) насанд хүрсэн, эрх зүйн
          бүрэн чадамжтай Монгол Улсын иргэн, харьяалалгүй хүн, гадаадын иргэнийг;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.3.4</Mon400>
        <Mon400 style={styles.listText}>
          “Мэдээлэл хариуцагч” эсхүл “Бид” гэж Хэрэглэгчээс олгосон цахим зөвшөөрлийн үндсэн дээр мэдээллийг цуглуулж, боловсруулж, ашиглаж буй
          “Центрик Айдиа” ХХК-ийг;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.3.5</Mon400>
        <Mon400 style={styles.listText}>“Мэдээлэл цуглуулах” гэж мэдээллийг олж авах, бүрдүүлэх, бүртгэх үйл ажиллагааг;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.3.6</Mon400>
        <Mon400 style={styles.listText}>
          “Мэдээлэл боловсруулах” гэж мэдээллийг ангилах, хадгалах, дүн шинжилгээ хийх, өөрчлөх, устгах, сэргээх үйл ажиллагаа тэдгээрийн нийлбэрийг;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.3.7</Mon400>
        <Mon400 style={styles.listText}>“Мэдээлэл ашиглах” гэж мэдээллийг үйл ажиллагаанд хэрэглэх, дамжуулах, мэдээлэлтэй танилцахыг;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.3.8</Mon400>
        <Mon400 style={styles.listText}>
          “Хэрэглэгчийг тодорхойлох боломжгүй болгох” гэж мэдээллийг тухайн хүнд хамааруулах боломжгүй болгох буюу хувь хүнийг шууд нэрлэн заах
          боломжгүй болгохыг;
        </Mon400>
      </View>

      <View style={styles.listContainer}>
        <Mon400>1.4</Mon400>
        <Mon400 style={styles.listText}>
          Та Эмуна-д бүртгүүлэхээс өмнө Нууцлалын бодлоготой бүрэн танилцах үүрэгтэй. Тус Нууцлалын бодлогод заасны дагуу өөрийн хувийн мэдээллийг
          цуглуулах, боловсруулах, ашиглах зөвшөөрлийг Бидэнд олгох эсэхийг хараат бусаар, бие даан шийдвэрлэнэ үү.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>1.5</Mon400>
        <Mon400 style={styles.listText}>
          Нууцлалын бодлогод заасан нөхцөлийг хүлээн зөвшөөрч буй тохиолдолд “Хүлээн зөвшөөрч байна” гэх хэсгийг дарж, идэвхжүүлэх бөгөөд энэхүү
          үйлдлийг гүйцэтгэснээр өөрийн хувийн мэдээллийг цуглуулах, боловсруулах, ашиглах цахим зөвшөөрлийг Мэдээлэл хариуцагчид олгосон гэж үзнэ.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>1.6</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэв Та Нууцлалын бодлогыг хүлээн зөвшөөрөхөөс татгалзаж буй бол энэ талаар нөхцөл, тайлбарыг [•] веб холбоосоор цахимаар илгээж, саналаа
          шийдвэрлүүлэх эрхтэй. Бид Танаас ирүүлсэн саналыг хүлээн авснаас хойш ажлын 14 хоногт багтаан шийдвэрлэх тул тус хугацаанд Эмуна-г ашиглах
          боломжгүй болно.
        </Mon400>
      </View>

      <Mon700 style={styles.title}>Хоёр. Бидний баримталдаг зарчим</Mon700>
      <View style={styles.listContainer}>
        <Mon400>2.1</Mon400>
        <Mon400 style={styles.listText}>
          Бид Хэрэглэгчийн хувийн мэдээллийн халдашгүй байдлыг ямагт хүндэтгэх бөгөөд хуульд заасан журам, Нууцлалын бодлогод зааснаас өөр байдлаар
          цуглуулахгүй, боловсруулахгүй, ашиглахгүй.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>2.2</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгчийн мэдээллийн халдашгүй байдлыг хангах хүрээнд мэдээллийн үнэн зөв, бүрэн байдлыг алдагдахгүйгээр хадгалж, хамгаална.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>2.3</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгч нь хувийн мэдээлэл цуглуулах, боловсруулах, ашиглах цахим зөвшөөрлийг цуцалснаас хойш түүний мэдээллийг боловсруулахгүй,
          ашиглахгүй, цаашид дахин цуглуулахгүй.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>2.4</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгчийн хувийн мэдээлэл цуглуулах, боловсруулах, ашиглахтай холбоотой хууль тогтоомжид нэмэлт өөрчлөлт орох бүрд Нууцлалын бодлогод
          өөрчлөлт, шинэчлэлтийг оруулна.
        </Mon400>
      </View>
      <Mon700 style={styles.title}>Гурав. Мэдээлэл цуглуулах, боловсруулах, ашиглах үндэслэл, зорилго</Mon700>
      <View style={styles.listContainer}>
        <Mon400>3.1</Mon400>
        <Mon400 style={styles.listText}>
          Бид Монгол Улсын Хүний хувийн мэдээллийг хамгаалах тухай хууль, Танаас олгосон цахим зөвшөөрлийн үндсэн дээр хэрэглэгчийн хувийн мэдээллийг
          цуглуулж, боловсруулж, ашиглана.
        </Mon400>
      </View>

      <View style={styles.listContainer}>
        <Mon400>3.2</Mon400>
        <Mon400 style={styles.listText}>Таны хувийн мэдээллийг дараах зорилгоор цуглуулж, боловсруулж, ашиглана. Үүнд:</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>3.2.1</Mon400>
        <Mon400 style={styles.listText}>
          Эмуна-аар дамжуулан Үйлчилгээний нөхцөлд заасан эмийн бүртгэл, хэрэглэх зааврын мэдээллийг Танд хялбар хүргэх, эмийн хэрэглээний сэрүүлэг
          тохируулах болон эмийн харилцан нөлөөллийн эрсдэлийг анхааруулах, сануулах үйлчилгээг үзүүлэхэд;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>3.2.2</Mon400>
        <Mon400 style={styles.listText}>Хэрэглэгчийг таньж баталгаажуулах (KYC);</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>3.2.3</Mon400>
        <Mon400 style={styles.listText}>Эмуна-гийн систем хөгжүүлэлтийг тасралтгүй гүйцэтгэх;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>3.2.4</Mon400>
        <Mon400 style={styles.listText}>Мэдээлэл технологийн хөгжилтэй нийцүүлэн харилцаа холбооны шинэ хялбар шийдлийг бий болгох;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>3.2.5</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгчийн эрүүл мэндийн болон эмийн хэрэглээний мэдээллийг түүнийг тодорхойлох боломжгүй болгосны үндсэн дээр эмийн зохистой хэрэглээг
          төлөвшүүлэх, бий болгоход холбогдох асуудлаар үйл ажиллагаа явуулдаг гуравдагч этгээдэд мэдээллийг дамжуулах, ашиглуулах.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>3.3</Mon400>
        <Mon400 style={styles.listText}>Хэрэглэгчийн хувийн мэдээллийг арилжаа, худалдааны зорилгоор цуглуулж, боловсруулж, ашиглахгүй болно.</Mon400>
      </View>

      <Mon700 style={styles.title}>Дөрөв. Мэдээлэл хариуцагч, түүнтэй холбоо барих мэдээлэл</Mon700>
      <View style={styles.listContainer}>
        <Mon400>4.1</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгчээс олгосон цахим зөвшөөрлийн үндсэн дээр хувийн мэдээллийг цуглуулах, боловсруулах, ашиглах эрх бүхий этгээд буюу мэдээлэл
          хариуцагч нь Монгол Улсын хуулийн этгээд “Центрик Айдиа” ХХК байна.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>4.2</Mon400>
        <Mon400 style={styles.listText}>
          Та Нууцлалын бодлогод заасан нөхцөл, хэрэгжилттэй холбоотой хүсэлт, санал, гомдлоо цахимаар илгээж шийдвэрлүүлэх эрхтэй.
        </Mon400>
      </View>

      <Mon700 style={styles.title}>Тав. Цуглуулах, боловсруулах, ашиглах мэдээллийн жагсаалт</Mon700>
      <View style={styles.listContainer}>
        <Mon400>5.1</Mon400>
        <Mon400 style={styles.listText}>
          Нууцлалын бодлогод заасан зорилгын хүрээнд Хэрэглэгчийн дараах мэдээллийг цуглуулж, боловсруулж, ашиглана. Үүнд:
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>5.1.1</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгчийг таньж баталгаажуулахад хамаарах мэдээлэл. Нэр, утасны дугаар, мэйл хаяг, төрсөн огноо, хүйс, өндөр, жин болон нууц үг буюу
          цахим гарын үсэг, мэдээлэл багтана.
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>5.1.2</Mon400>
        <Mon400 style={styles.listText}>
          Эмуна-аар дамжуулан үйлчилгээ авах, тохиргоо хийхэд хамаарах мэдээлэл. Таны эрүүл мэндийн мэдээлэл буюу харшил, архаг хууч, ужиг өвчин,
          хэрэглэдэг эмийн мэдээлэл, гэмтэл бэртэл, орж байсан хагалгаа, мэс ажилбар, буруу дадал, өвчин байгаа эсэх, жирэмсэн эсэх мэдээллүүд болон
          сэрүүлэг тохируулсан эмийн мэдээлэл багтана.
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>5.1.3</Mon400>
        <Mon400 style={styles.listText}>
          Мэдээллийн бүрэн бүтэн байдлыг хангахад хамаарах мэдээлэл. Хэрэглэгчийн нэвтэрсэн, гарсан цаг, төхөөрөмжийн бүртгэл, хэрэглэгчийн идэвхтэй,
          идэвхгүй байх үеийн бүртгэл, нууц кодыг буруу, эсхүл давтан хийсэн тэмдэглэлүүд, нэг удаагийн нууц үгийн жагсаалт, нууц кодыг өөрчлөх
          давтамж, Танаас ирүүлсэн санал, хүсэлт, гомдол, түүнийг шийдвэрлэсэн байдлын талаарх мэдээлэл хамаарна.
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>5.1.4</Mon400>
        <Mon400 style={styles.listText}>
          Мэдээллийн системийг хөгжүүлэх, үйлчилгээний шинэ шийдлийг нэвтрүүлэхэд чиглэсэн мэдээлэл. Хэрэглэгчийн Эмуна-г ашиглаж буй давтамжийн
          мэдээлэл, cookie файлын тусламжтайгаар олж авсан мэдээллүүд багтана.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>5.2</Mon400>
        <Mon400 style={styles.listText}>
          Мэдээлэл хариуцагч нь энэ бүлэгт зааснаас өөр мэдээллийг цуглуулж, боловсруулж, ашиглах тохиолдолд Нууцлалын бодлогод нэмэлт, өөрчлөлт
          оруулж, Хэрэглэгчээс цахим зөвшөөрлийг авна.
        </Mon400>
      </View>
      <Mon700 style={styles.title}>Зургаа. Мэдээлэл боловсруулах, ашиглах хугацаа</Mon700>
      <View style={styles.listContainer}>
        <Mon400>6.1</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгчээс цахим зөвшөөрлийг олгосноор Мэдээлэл хариуцагч нь хувийн мэдээллийг цуглуулж, боловсруулж, ашиглана.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>6.2</Mon400>
        <Mon400 style={styles.listText}>
          Мэдээлэл хариуцагч нь Хэрэглэгчийн хүсэлтээр бүртгэлийг хаах хүртэл хугацаанд мэдээллийг боловсруулж, ашиглана.
        </Mon400>
      </View>
      <Mon700 style={styles.title}>Долоо. Мэдээллийг нийтэд ил болгох эсэх</Mon700>
      <View style={styles.listContainer}>
        <Mon400>7.1</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгчийн хувийн мэдээллийн халдашгүй байдлыг хангах хүрээнд Мэдээлэл хариуцагч нь мэдээллийг нийтэд ил болгох арга хэмжээг авахгүй
          болно.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>7.2</Mon400>
        <Mon400 style={styles.listText}>
          Зөвхөн Хүний хувийн мэдээлэл хамгаалах тухай хуулийн 7 дугаар зүйлийн 7.1.3-д заасан хүрээнд эрдэм шинжилгээ, нээлттэй өгөгдөл, статистикийн
          мэдээлэл бэлтгэх зорилгоор Таны мэдээллийг тодорхойлох боломжгүй болгож, нийтэд нээлттэй ил болгоно.
        </Mon400>
      </View>

      <Mon700 style={styles.title}>Найм. Мэдээллийг дамжуулах нөхцөл, мэдээллийн жагсаалт</Mon700>
      <View style={styles.listContainer}>
        <Mon400>8.1</Mon400>
        <Mon400 style={styles.listText}>
          Мэдээлэл хариуцагч нь хууль дээдлэх зарчмыг удирдлага болгон дараах тохиолдолд Нууцлалын бодлогын 5 дугаар бүлэгт жагсаан тодорхойлсон Таны
          хувийн мэдээллийг бусад этгээдэд дамжуулна. Үүнд:
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>8.1.1</Mon400>
        <Mon400 style={styles.listText}>Монгол Улсын шүүхийн шүүгчийн захирамж гарсан;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>8.1.2</Mon400>
        <Mon400 style={styles.listText}>Прокурорын тогтоол гарсан;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>8.1.3</Mon400>
        <Mon400 style={styles.listText}>Хууль сахиулах байгууллагын шаардлагаар мөрдөгчийн саналыг прокурор зөвшөөрсөн албан тоотыг үндэслэн;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>8.1.4</Mon400>
        <Mon400 style={styles.listText}>
          Засгийн газрын хэрэгжүүлэгч агентлаг Эм, эмнэлгийн хэрэгслийн хяналт, зохицуулалтын газартай байгуулсан “Хамтын ажиллагааны санамж
          бичиг”-ийн хүрээнд гагцхүү хэрэглэгчийг тодорхойлох боломжгүй болгосон хэлбэрээр Таны нас, хүйс, эрүүл мэндийн болон эмийн хэрэглээний
          мэдээллийг дамжуулна;
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>8.2</Mon400>
        <Mon400 style={styles.listText}>
          Мэдээлэл хариуцагч нь Нууцлалын бодлогын 8.1 дэх хэсэгт зааснаас бусад тохиолдолд Хэрэглэгчийн хувийн мэдээллийг нийтэд ил болгохгүй.
        </Mon400>
      </View>

      <Mon700 style={styles.title}>Ес. Зөвшөөрөл цуцлах хэлбэр</Mon700>
      <View style={styles.listContainer}>
        <Mon400>9.1</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгч нь Мэдээлэл хариуцагчид олгосон хувийн мэдээллийг цуглуулах, боловсруулах, ашиглах цахим зөвшөөрлийг цуцлах хүсэлтийг цахим
          хэлбэрээр илгээнэ.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>9.2</Mon400>
        <Mon400 style={styles.listText}>
          Мэдээлэл хариуцагч нь зөвшөөрөл цуцлах хүсэлтийг хүлээн авснаас хойш ажлын 20 (хорь) хоногт багтаан хүсэлтийг шийдвэрлэнэ.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>9.3</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгчийн мэдээллийг цуглуулах, боловсруулах, зөвшөөрөл цуцлагдсан тохиолдолд Мэдээлэл хариуцагч нь мэдээллийг боловсруулж, ашиглах арга
          хэмжээг зогсоож, бүртгэлийг идэвхгүй болно.
        </Mon400>
      </View>
      <Mon700 style={styles.title}>Арав. Бусад</Mon700>
      <View style={styles.listContainer}>
        <Mon400>10.1</Mon400>
        <Mon400 style={styles.listText}>
          Нууцлалын бодлогод нэмэлт, өөрчлөлт орсон даруйд Хэрэглэгч нь танилцаж, дагаж мөрдөх үүрэгтэй бөгөөд тухайн нөхцөлтэй танилцах боломжоор
          хангаж, Эмуна-д нээлттэй байршуулах тул Хэрэглэгч танилцах үүрэг хүлээнэ.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>10.2</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгч нь Нууцлалын бодлого, түүний нэмэлт, өөрчлөлтийг мэдээгүй, танилцсан ч ойлгоогүйн улмаас үүсэх асуудлыг Бид хариуцахгүй. Хэрэглэгч
          Нууцлалын бодлоготой холбоотой асууж, тодруулах нээлттэй байх болно.
        </Mon400>
      </View>
    </ScrollView>
  );
});

SecretPrivacyScreen.displayName = "SecretPrivacyScreen";

export default SecretPrivacyScreen;

const styles = StyleSheet.create({
  container: {
    flex             : 1,
    backgroundColor  : Colors.white,
    paddingHorizontal: 16,
  },
  title: {
    fontSize      : 16,
    textAlign     : "center",
    marginVertical: 4,
  },
  description: {
    fontSize      : 12,
    marginVertical: 4,
  },
  listContainer: {
    flexDirection: "row",
    width        : "90%",
    marginTop    : 8,
  },
  listText: {
    fontSize  : 12,
    marginLeft: 10,
  },
  lists: {
    marginHorizontal: 32,
    flexDirection   : "row",
    width           : "80%",
    marginTop       : 4,
  },
});
