import { ScrollView, StyleSheet, View } from "react-native";
import React, { memo } from "react";
import { Colors } from "../../constants/Colors";
import { Mon400, Mon700 } from "../../components/StyledText";

const PrivacyScreen = memo(() => {
  return (
    <ScrollView showsVerticalScrollIndicator={false} style={styles.container}>
      <Mon700 style={styles.title}>“Эмуна Үйлчилгээний нөхцөл ”</Mon700>
      <Mon400 style={styles.description}>
        Энэхүү Үйлчилгээний нөхцөл нь Центрик Айдиа ХХК Компани”, эсхүл “Бид”)-аас хөгжүүлсэн иргэнд эмийн зохистой хэрэглээний дадал үүсгэх зорилго
        бүхий үйлчилгээг санал болгож буй гар утасны Эмуна аппликейшн (“Эмуна”)- ( ыг Хэрэглэгч “ ” Та “ эсхүл Хэрэглэгч”) , ашиглах журам нөхцөлийг .
        тодорхойлно
      </Mon400>
      <Mon400 style={styles.description}>
        Та Эмуна-д бүртгүүлснээр Үйлчилгээний нөхцөлийг заавал дагаж мөрдөх , үүрэг хүлээх тул бүрэн танилцаж хүлээн зөвшөөрч буй эсэх илэрхийллээ .
        баталгаажуулна уу
      </Mon400>
      <Mon400 style={styles.description}>
        Та Эмуна д нэвтэрч бүртгүүлэхээс өмнө Үйлчилгээний нөхцөл . Нууцлалын бодлоготой нэг бүрчлэн танилцана уу Хэрэглэгч Үйлчилгээний нөхцөл
        Нууцлалын бодлоготой бүрэн танилцаж тэдгээрт заасан нөхцөлүүдийг хүлээн зөвшөөрч харгалзах хэсгийг . чагталснаар зөвшөөрсөн гэж үзнэ“ ”Харин
        Та Зөвшөөрсөн хэсгийг идэвхжүүлээгүй бол Үйлчилгээний нөхцөлийг хүлээн зөвшөөрөхөөс татгалзсан гэж үзэж Эмуна- . г ашиглах боломжгүй болохыг
        мэдэгдэж байна
      </Mon400>
      <Mon700 style={styles.title}>Нэг Ерөнхий нөхцөл</Mon700>
      <View style={styles.listContainer}>
        <Mon400>1.1</Mon400>
        <Mon400 style={styles.listText}>
          Эмуна нь Танд эмийн бүртгэлийн мэдээллийг хялбар ойлгомжтойгоор хүргэх хэрэглэж буй эмийн сэрүүлэг тохируулах хэрэглэгчийн оруулсан эрүүл
          мэндийн мэдээлэлд үндэслэн эмийн хэрэглээ эрүүл амьдралын хэвшилд хамаарах асуудлаар анхааруулга санамж өгөх уриалах замаар эмийн үр ашиггүй
          давтан хэрэглээг бууруулах эмийг цаг тухай бүр жор зааврын дагуу бүрэн гүйцэт хэрэглэх эмийн зохистой хэрэглээний дадал үүсгэх зорилго бүхий
          үйлчилгээ (“Үйлчилгээ” )- iOS Android гэх г санал болгож буй болон үйлдлийн . системд суурилагдсан технологийн шийдэл юм
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>1.2</Mon400>
        <Mon400 style={styles.listText}>
          Эмуна нь Танд эмийн бүртгэлийн мэдээллийг хялбар ойлгомжтойгоор Бид Засгийн газрын хэрэгжүүлэгч агентлаг Эм эмнэлгийн хэрэгслийн, хяналт
          зохицуулалтын газраас хүргэдэг http://licemed.mohs.mn/ нээлттэй . өгөгдлийн санд үндэслэн Танд эмийн бүртгэлийн мэдээллийг хүргэнэ
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>1.3</Mon400>
        <Mon400 style={styles.listText}>
          Бид Эмуна-гийн тасралтгүй найдвартай хэвийн ажиллах нөхцөлийг . хангах зорилгоор хөгжүүлэлтийг тогтмол хийж гүйцэтгэнэ
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>1.4</Mon400>
        <Mon400 style={styles.listText}>Хэрэглэгчийн Эмуна дээрх үйлдэл бүрийн эрх зүйн үр дагаврыг. Хэрэглэгч өөрөө хариуцна</Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>1.5</Mon400>
        <Mon400 style={styles.listText}>Үйлчилгээний нөхцөлд дурдсан дараах нэр томъёог дор дурдсан утгаар ойлгож хэрэглэнэ Үүнд:</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.5.1</Mon400>
        <Mon400 style={styles.listText}>
          “Хэрэглэгч” эсхүл “Та” гэж Эмуна-д нэвтэрч, өөрийн бүртгэлийг үүсгэн, Бидний үйлчилгээг авах гэж буй 18 (арван найм) насанд хүрсэн, эрх зүйн
          бүрэн чадамжтай Монгол Улсын иргэн, харьяалалгүй хүн, гадаадын иргэнийг;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.5.2</Mon400>
        <Mon400 style={styles.listText}>
          “Эрүүл мэнд” гэж хүн өвчин, эмгэггүй, бие бялдар, оюун санаа, нийгмийн амьдралын хувьд сайн сайхан байхыг;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.5.3</Mon400>
        <Mon400 style={styles.listText}>
          “Эм” гэж хүний болон мал, амьтны өвчнөөс урьдчилан сэргийлэх, өвчнийг оношлох, эмчлэх, дархлаажуулах зориулалттай, үйлчлэл нь эм судлал,
          эмнэлзүйн сорилт туршилтаар нотлогдсон, нийлэг буюу амьтан, ургамал, эрдсийн гаралтай бодисыг тодорхой хэлбэрт оруулсан, зохих тун,
          хэмжээгээр хэрэглэдэг бэлдмэлийг;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.5.4</Mon400>
        <Mon400 style={styles.listText}>
          “Биологийн идэвхт бүтээгдэхүүн” гэж хүний бие махбодийн үйл ажиллагааг дэмжих, зайлшгүй шаардлагатай эрдэс бодисоор нөхөх, аливаа өвчин
          эмгэгээс урьдчилан сэргийлэх үйлчилгээ бүхий бүтээгдэхүүнийг;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.5.5</Mon400>
        <Mon400 style={styles.listText}>
          “Эмийн бүртгэл” гэж хими, биологи, эм судлал, эмийн үнэлэмжийн үндсэн дээр урьдчилсан сэргийлэлт, оношлогоо, эмчилгээнд хэрэглэж болох нь
          нотлогдсон эмийг Монгол Улсын нутаг дэвсгэрт хэрэглээнд гаргахыг зөвшөөрөх үйл ажиллагааг;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.5.6</Mon400>
        <Mon400 style={styles.listText}>“Бүртгэлгүй эм” гэж Монгол Улсын Эмийн бүртгэлд бүртгэгдээгүй эм, биологийн идэвхт бүтээгдэхүүнийг;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.5.7</Mon400>
        <Mon400 style={styles.listText}>
          “Эмийн зохистой хэрэглээ” гэж эмийг шаардлагатай үед эмч, эм зүйчийн заавар, зөвлөмжийн дагуу зөв хэрэглэхийг;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.5.8</Mon400>
        <Mon400 style={styles.listText}>
          “Эмнэлгийн мэргэжилтэн” гэж мэргэжлийн үйл ажиллагаа эрхлэх зөвшөөрөл бүхий хүний их, бага эмч, эм зүйч, эм найруулагчийг;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>1.5.9</Mon400>
        <Mon400 style={styles.listText}>
          “Үйлчилгээний төлбөр” гэж Эмуна-гийн Эмуна про үйлчилгээгээр дамжуулан Хэрэглэгчид хүргэж буй эм уух сэрүүлэг, эрүүл амьдралын хэвшилд
          хамаарах дадал, зөвлөмж зэргийг бэлтгэх үйл ажиллагааны зардлыг санхүүжүүлэх зорилгоор үйлчилгээ үзүүлсний төлөө Компаниас тогтоож,
          Үйлчилгээ авч буй Хэрэглэгчээр урьдчилан төлүүлэх мөнгөн дүнг.{" "}
        </Mon400>
      </View>
      <Mon700 style={styles.title}>Хоёр. Хэрэглэгчийн бүртгэл</Mon700>
      <View style={styles.listContainer}>
        <Mon400>2.1</Mon400>
        <Mon400 style={styles.listText}>
          Та Эмуна-гийн “Нэвтрэх” хэсэгт дарж өөрийн утасны дугаар, нэг удаагийн нууц үгийг оруулснаар Үйлчилгээний нөхцөл, Нууцлалын бодлого гарч
          ирнэ.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>2.2</Mon400>
        <Mon400 style={styles.listText}>
          Үйлчилгээний нөхцөл, Нууцлалын бодлоготой бүрэн танилцаж, “зөвшөөрсөн” хэсгийг идэвхжүүлснээр Та Эмунад нэвтэрнэ.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>2.3</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгч ийнхүү нэвтэрсний дараа Хэрэглэгчийн бүртгэлд хамаарах хэрэглэгчийн нэр, эцэг /эх/-ийн нэр, и-мэйл хаяг, утасны дугаар, хүйс,
          төрсөн огнооны мэдээлэлд үндэслэн бүртгэлийг баталгаажуулна. Хэрэглэгч өөрийн биеийн үзүүлэлт болох өндөр, жин, нас, эрүүл мэндийн мэдээлэл
          болох харшил, буруу дадал, гэмтэл, ужиг өвчин, өвчтэй байгаа эсэх, жирэмсэн эсэх зэрэг бусад мэдээллийг оруулж, өөрчилж болно. Та оруулж буй
          мэдээллийн үнэн зөвийг өөрөө нягтлах үүрэгтэй ба мэдээлэл буруу, дутуу оруулснаас үүсэх үр дагаврыг өөрөө хариуцна.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>2.4</Mon400>
        <Mon400 style={styles.listText}>
          Эмуна-гаас Хэрэглэгчийн хувийн мэдээллийг цуглуулах, боловсруулах, ашиглахтай холбоотой харилцааг Нууцлалын бодлогоор зохицуулах бөгөөд
          Нууцлалын бодлого нь Үйлчилгээний нөхцөлийн салшгүй хэсэг байна.
        </Mon400>
      </View>
      <Mon700 style={styles.title}>Гурав. Эмуна-гаас хүргэх мэдээлэл</Mon700>
      <View style={styles.listContainer}>
        <Mon400>3.1</Mon400>
        <Mon400 style={styles.listText}>Компани нь Хэрэглэгчид Эмуна-гаар дамжуулан дараах мэдээллийг хүргэнэ. Үүнд:</Mon400>
      </View>
      <Mon400>А. Эмийн бүртгэлийн мэдээллийн хүрээнд</Mon400>
      <Mon400 style={styles.listText}>-Худалдааны нэр;</Mon400>
      <Mon400 style={styles.listText}>-Олон улсын нэршил;</Mon400>
      <Mon400 style={styles.listText}>-Олгох нөхцөл (жоргүй, жороор);</Mon400>
      <Mon400 style={styles.listText}>-Эмийн тун хэмжээ;</Mon400>
      <Mon400 style={styles.listText}>-Эмийн хэлбэр;</Mon400>
      <Mon400 style={styles.listText}>-Эмийн эмчилгээний бүлэг;</Mon400>
      <Mon400 style={styles.listText}>-Эм бүртгэлтэй, бүртгэл хүчинтэй эсэх;</Mon400>
      <Mon400>Б. Эмийн хэрэглэх зааврын хүрээнд</Mon400>
      <Mon400 style={styles.listText}>-Хэрэглэх заавар;</Mon400>
      <Mon400 style={styles.listText}>-Хориглох заалт;</Mon400>
      <Mon400 style={styles.listText}>-Гаж нөлөө;</Mon400>
      <Mon400 style={styles.listText}>-Бусад эмтэй харилцан үйлчлэл;</Mon400>
      <Mon400 style={styles.listText}>-Хэрэглэх арга, тун;</Mon400>
      <Mon400 style={styles.listText}>-Хадгалах нөхцөл;</Mon400>
      <View style={styles.listContainer}>
        <Mon400>3.2</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгч ууж буй болон уухаар төлөвлөж буй эмийн мэдээллийг Эмуна-д оруулж, уух цагийн сэрүүлгийг тохируулахдаа эмнэлгийн мэргэжилтний
          өгсөн зөвлөгөө, зааврийн дагуу өөрөө оруулах эсхүл тухайн эмнэлгийн мэргэжилтнээр цагийн тохиргоог оруулуулах боломжтой байна.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>3.3</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгчид хүргэж буй эмийн бүртгэл болон хэрэглэх зааврын мэдээлэл нь Монгол Улсын Эмийн бүртгэлд бүртгэгдсэн албан ёсны мэдээлэл боловч
          энэ нь Хэрэглэгчид тухайн зааварт үндэслэн өөрөө дур мэдэж тэдгээрийг хэрэглэхийг санал болгож буй үйлдэл биш болно.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>3.4</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгч өөрийн ууж буй эсхүл уухаар төлөвлөж буй эмийг Монгол Улсын Эмийн бүртгэлд бүртгэгдсэн эсэхийг шалгахад “бүртгэлгүй” байх
          тохиолдолд энэ талаар Эмуна-гаар дамжуулан Эм, эмнэлгийн хэрэгслийн хяналт, зохицуулалтын газарт мэдээлэх үүрэгтэй.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>3.5</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгч “бүртгэлгүй эм”-ийг хэрэглэх эсэх шийдвэрийг өөрөө гаргах ба “бүртгэлгүй эм”-ийг уух сэрүүлгийг Эмуна-д тохируулж болох боловч
          эдгээртэй холбоотой гарсан аливаа эрсдлийг Компани хариуцахгүй.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>3.6</Mon400>
        <Mon400 style={styles.listText}>
          Эмнэлгийн мэргэжилтэн нь Хэрэглэгчийн бие махбодийн онцлог, өвчний шинж чанар, онцлог зэргийг харгалзан Эмуна дах эмийн бүртгэл, хэрэглэх
          заавар дах мэдээллээс их, эсхүл бага хэмжээгээр хэрэглэхээр зөвлөх боломжтой. Эмчийн жор, эмийн бүртгэлийн мэдээлэл дэх хэрэглэх зааврын тун
          хэмжээ зөрчилдсөн тохиолдолд Компани хариуцахгүй.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>3.7</Mon400>
        <Mon400 style={styles.listText}>
          Эмуна Танд жороор олгох, эмнэлгийн нөхцөлд хэрэглэх эмийн хэрэглэх зааварт хамаарах мэдээлэл (Үйлчилгээний нөхцөлийн 3.1.Б)-ийг дамжуулахгүй
          ба энэ төрлийн эмийн хэрэглэх зааврыг эмнэлгийн мэргэжилтнээс лавлахыг зөвлөж байна. Энэ зүйлтэй холбоотойгоор үүсэх үр дагаврыг Хэрэглэгч
          өөрөө хариуцахыг анхаарна уу.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>3.8</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгч хэд хэдэн эм, биологийн идэвхт бүтээгдэхүүнийг уух сэрүүлэг тохируулсан бөгөөд тэдгээр нь уух цаг, үйлчлэгч бодисоос хамаараад
          харилцан үйлчлэлийн хувьд харшлах, аль нэг эмийн үйлчлэлийг дарангуйлах зэрэг шинж тэмдэг илэрч болзошгүй тохиолдолд Эмуна энэ талаарх
          анхааруулгыг Хэрэглэгчид хүргэж, сануулна. Тус анхааруулга, санамж нь Монгол Улсын эмийн бүртгэлийн мэдээллийг хиймэл оюун ухааны
          тусламжтайгаар боловсруулсны үр дүнд хэрэглэгчид хүргэж буй мэдээлэл тул дэлгэрэнгүй мэдээлэл, зөвлөгөөг эмнэлгийн мэргэжилтнээс лавлах
          шаардлагатайг анхаарна уу.
        </Mon400>
      </View>
      <Mon700 style={styles.title}>Дөрөв. Үйлчилгээний төлбөр</Mon700>
      <View style={styles.listContainer}>
        <Mon400>4.1</Mon400>
        <Mon400 style={styles.listText}>Эмуна-гийн Үйлчилгээний төлбөр нь сарын/жилийн (*) төгрөг байна.</Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>4.2</Mon400>
        <Mon400 style={styles.listText}>Хэрэглэгч Үйлчилгээний төлбөрийг төлснөөр Үйлчилгээ авах эрх нээгдэнэ.</Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>4.3</Mon400>
        <Mon400 style={styles.listText}>
          Үйлчилгээний төлбөрийн хувь хэмжээг тогтоох, өөрчлөх эрхийг Компани дангаар эдлэх бөгөөд өөрчилж, шинэчилсэн нөхцөлийг Хэрэглэгчид Эмуна-аар
          дамжуулан мэдэгдэнэ.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>4.4</Mon400>
        <Mon400 style={styles.listText}>Үйлчилгээний төлбөр төлөлт эцсийнх бөгөөд Хэрэглэгчид бүтэн болон хэсэгчлэн буцаан олгохгүй болно.</Mon400>
      </View>
      <Mon700 style={styles.title}>Тав. Хэрэглэгчийн эрх, үүрэг</Mon700>
      <View style={styles.listContainer}>
        <Mon400>5.1</Mon400>
        <Mon400 style={styles.listText}>Хэрэглэгч Эмуна-г ашиглахдаа дараах эрх эдэлнэ:</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>5.1.1</Mon400>
        <Mon400 style={styles.listText}>Хэрэглэгчийн бүртгэлд хамаарахаас бусад хувийн мэдээллийг оруулах, өөрчлөх, устгах;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>5.1.2</Mon400>
        <Mon400 style={styles.listText}>Эмийн бүртгэлийн мэдээлэлтэй чөлөөтэй танилцах, ашиглах;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>5.1.3</Mon400>
        <Mon400 style={styles.listText}>Өөрийн эмийн хэрэглээ, тохируулсан цаг, тоо, давтамжийн мэдээллийг тухай бүр, тогтмол хянах;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>5.1.4</Mon400>
        <Mon400 style={styles.listText}>Бүртгэлийн нууц үгийг сэргээх, солих;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>5.1.5</Mon400>
        <Mon400 style={styles.listText}>Өөрийн эмийн хэрэглээ, дадлын түүхийг харах.</Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>5.2</Mon400>
        <Mon400 style={styles.listText}>Хэрэглэгч Эмуна-г ашиглахдаа дараах үүрэгтэй. Үүнд:</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>5.2.1</Mon400>
        <Mon400 style={styles.listText}>Хэрэглэгч Эмуна-г Үйлчилгээний нөхцөлийн дагуу хуульд нийцүүлэн ашиглах үүрэгтэй;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>5.2.2</Mon400>
        <Mon400 style={styles.listText}>Хэрэглэгчийг бүртгэхэд зайлшгүй шаардлагатай мэдээллийг бүрэн гүйцэд, үнэн зөв оруулах;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>5.2.3</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгч Эмуна дах эмийн хэрэглэх зааварт үндэслэн өөрөө дур мэдэж эм, биологийн идэвхт бүтээгдэхүүн хэрэглэхгүй байх;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>5.2.4</Mon400>
        <Mon400 style={styles.listText}>Эмийг гагцхүү эмнэлгийн мэргэжилтний заавар, зөвлөмжөөр буюу эмчийн бичсэн жорын дагуу хэрэглэх;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>5.2.5</Mon400>
        <Mon400 style={styles.listText}>Үйлчилгээний төлбөр төлөх;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>5.2.6</Mon400>
        <Mon400 style={styles.listText}>
          Эмуна-д нэвтрэх нэр, нууц үгийн аюулгүй байдлыг хангаж аливаа гуравдагч этгээдэд хэлэх, дамжуулах, ашиглуулах үйлдлээс зайлсхийх, эдгээрийн
          улмаас үүсэх эрсдэл, үр дагаврыг өөрөө бүрэн хариуцах.
        </Mon400>
      </View>
      <Mon700 style={styles.title}>Зургаа. Оюуны өмчийн эрхийн хамгаалалт</Mon700>
      <View style={styles.listContainer}>
        <Mon400>6.1</Mon400>
        <Mon400 style={styles.listText}>
          Эмуна-ийн тохиргоо, үйлчилгээ, загвар, үндсэн бүтэц, программчлалд холбогдох материал, барааны тэмдэг, зохиогчийн эрх нь Бидний оюуны өмч
          байна. Хэрэглэгч нь ижил төстэй, үл ялгагдах, нийтэд төөрөгдөл бий болгох ижил төрлийн үйлчилгээг олон нийтэд санал болгож болохгүй бөгөөд
          оюуны өмчийг хүндэтгэнэ.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>6.2</Mon400>
        <Mon400 style={styles.listText}>
          Компанийн оюуны өмчид хамаарах заалтыг Хэрэглэгч зөрчсөн тохиолдолд түүний үр дагаварт учирсан хохирол, нөхөн төлбөрийг хариуцна.
        </Mon400>
      </View>
      <Mon700 style={styles.title}>Долоо. Үйлчилгээний хязгаарлалт</Mon700>
      <View style={styles.listContainer}>
        <Mon400>7.1</Mon400>
        <Mon400 style={styles.listText}>
          Та дараах үйлдлүүдийг гүйцэтгэсэн эсхүл гүйцэтгэхийг оролдсон нөхцөлд Бид Таны Эмуна-гийн хэрэглээг тодорхой хугацаагаар хязгаарлах эсхүл
          зогсоох, хэрэглэгчийн бүртгэлийг идэвхгүй болгох, хаах арга хэмжээг авна. Үүнд:
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>7.1.1 </Mon400>
        <Mon400 style={styles.listText}>Үйлчилгээг зүй бусаар эсхүл хууль бус зорилгоор ашигласан;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>7.1.2 </Mon400>
        <Mon400 style={styles.listText}>
          Эмуна-гийн программ хангамж, системийн тохиргоог өөрчлөлт оруулах замаар ашиглах, өөрчлөлт оруулах, Эмуна-г хуулбарлаж, өөр программ
          хангамжийг бий болгох;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>7.1.3 </Mon400>
        <Mon400 style={styles.listText}>
          Өөрийн хэрэглэгчийн бүртгэлийг бусдад төлбөртэй, төлбөргүй шилжүүлэх замаар Эмуна-г түрээслэх, эсхүл бусдад ашиглуулах;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>7.1.4 </Mon400>
        <Mon400 style={styles.listText}>
          Эмуна-гийн хэвийн үйл ажиллагаанд зориудаар саад болох, үйлчилгээг удаашруулах, зогсоох, тасалдуулах арга хэмжээг зохион байгуулах;
        </Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>7.1.5 </Mon400>
        <Mon400 style={styles.listText}>Оюуны өмчийн эрхэд халдах;</Mon400>
      </View>
      <View style={styles.lists}>
        <Mon400>7.1.6 </Mon400>
        <Mon400 style={styles.listText}>Хэрэглэгчийн бүртгэлийг хуурамчаар үүсгэх.</Mon400>
      </View>
      <Mon700 style={styles.title}>Найм. Эмуна-гийн аюулгүй байдал, эрсдэл</Mon700>
      <View style={styles.listContainer}>
        <Mon400>8.1</Mon400>
        <Mon400 style={styles.listText}>
          Бид Эмуна-гийн аюулгүй байдлыг хангах хүрээнд бололцоот бүхий л арга хэмжээг авч ажиллах бөгөөд биднээс үл хамаарах шалтгаанаар Үйлчилгээ
          түр тасалдаж, доголдож болохыг анхааруулж байна.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>8.2</Mon400>
        <Mon400 style={styles.listText}>
          Гуравдагч этгээдийн мэдээллийн сүлжээнд эвдрэл гэмтэл гарах, тасалдах эсхүл байгалийн давагдашгүй хүчин зүйлс, кибер халдлагын улмаас
          Эмуна-гийн хэвийн үйл ажиллагаанд сөрөг нөлөө учирч болно.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>8.3</Mon400>
        <Mon400 style={styles.listText}>Үйлчилгээ түр тасалдсан, доголдсон даруйд Бид боломжит хугацаанд хариу арга хэмжээг авч ажиллана.</Mon400>
      </View>
      <Mon700 style={styles.title}>Ес. Маргаан шийдвэрлэх журам</Mon700>
      <View style={styles.listContainer}>
        <Mon400>9.1</Mon400>
        <Mon400 style={styles.listText}>
          Та Эмуна, Үйлчилгээтэй холбоотой аливаа санал, гомдол, хүсэлтийг цахимаар илгээж, хүсэлт, санал, гомдлоо шийдвэрлүүлэх эрхтэй.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>9.2</Mon400>
        <Mon400 style={styles.listText}>
          Бид цахимаар ирүүлсэн Таны санал, гомдол, хүсэлтийг хүлээн авснаас хойш ажлын * (*) хоногт багтаан хариуг Хэрэглэгчийн бүртгэлтэй цахим
          хаягаар хүргүүлнэ.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>9.3</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгчтэй холбоотой маргааныг харилцан ойлгож, хэлэлцээрийн журмаар шийдвэрлэхийг эрмэлзэнэ. Үр дүн гараагүй бол маргааныг Монгол Улсын
          хуулийн дагуу шүүхээр шийдвэрлүүлнэ.
        </Mon400>
      </View>
      <Mon700 style={styles.title}>Арав. Нэмэлт өөрчлөлт</Mon700>
      <View style={styles.listContainer}>
        <Mon400>10.1</Mon400>
        <Mon400 style={styles.listText}>
          Бид Үйлчилгээний нөхцөл-д нэмэлт, өөрчлөлт орсон даруйд Эмуна-д нээлттэй байршуулж Хэрэглэгч түүнтэй танилцах нөхцөл боломжийг бүрдүүлнэ.
        </Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>10.2</Mon400>
        <Mon400 style={styles.listText}>Хэрэглэгч Үйлчилгээний нөхцөлд нэмэлт, өөрчлөлт орсон даруйд танилцах, дагаж мөрдөх үүрэгтэй.</Mon400>
      </View>
      <View style={styles.listContainer}>
        <Mon400>10.3</Mon400>
        <Mon400 style={styles.listText}>
          Хэрэглэгч Үйлчилгээний нөхцөл, түүний нэмэлт, өөрчлөлтийг мэдээгүй, танилцсан ч ойлгоогүйн улмаас үүсэх асуудлыг Бид хариуцахгүй. Хэрэглэгч
          Үйлчилгээний нөхцөлтэй холбоотой аливаа асуудлыг Биднээс асууж, тодруулах нь нээлттэй болно.
        </Mon400>
      </View>
    </ScrollView>
  );
});

PrivacyScreen.displayName = "PrivacyScreen";

export default PrivacyScreen;

const styles = StyleSheet.create({
  container: {
    flex             : 1,
    backgroundColor  : Colors.white,
    paddingHorizontal: 16,
  },
  title: {
    fontSize      : 16,
    textAlign     : "center",
    marginVertical: 4,
  },
  description: {
    fontSize      : 12,
    marginVertical: 4,
  },
  listContainer: {
    flexDirection: "row",
    width        : "90%",
    marginTop    : 8,
  },
  listText: {
    fontSize  : 12,
    marginLeft: 10,
  },
  lists: {
    marginHorizontal: 32,
    flexDirection   : "row",
    width           : "80%",
    marginTop       : 4,
  },
});
